""""2) მომხმარებელს input-ის საშვალებით შემოტანინეთ ორი რიცხვი number1 და number2 შემდეგ კი დაბეჭდეთ მათი ჯამი. ასევე შექმენით level-ის ცვლადი რომელშიც მომხამრებელს შემოაყვანინებთ მათ ამჟამინდელ level-ს, შეეცადეთ level-ის მნიშვნელობას დაუმატოთ ერთი და ისე დაბეჭდოთ. მიღებული შედეგებით გამოიტანეთ დასკვნა და დაწერეთ კომენტარებით"""
number1=input("put number one:")
number2=input("put number two:")

print(number1 + number2)

#ტერმინალში პირველ რიცხვს მეორე რიცხვი გვერდით მიეწერა და არ შესრულდა მათემატიკური მოქმედება რადგან ეს რიცხვები აღინიშნება როგორც სტრინგი

Level=input("current Level:")
print(Level+1)

#ტერმინალმა ამოგვიგდო ერორი რადგან სტრინგს მივუტმატეთ რიცხვი