"""მოხმარებელს შემოატანინეთ რიცხვი, შემდეგ კი დაუბეჭდეთ ეს რიცხვი დადებითია, უარყოფითი თუ ნეიტურალი ანუ ნული. შემდეგ კომენტარებით ახსენით რა გასნხვავებაა if-სა და elif-ს შორის რატომ არ შეიძლება ზოგერ elif-ს ნაცვლად if-ის გამოყენება"""

number=int(input("enter nummber"))
if number > 0:  #if გამოიყენება პირობის შესამოწმებლად
    print("positive")
elif number < 0: #elif გამოიყენება დამატებითი პირობის შესამოწმებლად იმ შემთხვევაში, თუ წინა if ან სხვა elif პირობა არ შესრულდა
    print("negative")
else:
    print("neutral")

#if-ს შეუძლია დამოუკიდებლად არსებობა ხოლო elif-ს შეუძლია არსობობა მხოლოდ if-თან ან სხვა elif-თან