"""შექმენით 5 ცვლადი, რომლებშიც შეინახავთ განსხვავებულ ლოგიკურ და შედარების ოპერაციათა შედეგებს (უნდა იყოს შედარების და ლოგიკური ოპერატორები ერთად მაგალითად temperature > 30 and not cloudy), გვერდზე კომენტარის საშვალებით მიუწერეთ ეს შედეგი (boolean მნიშვნელობა) აიღეთ მრავალფეროვანი კომბინაციები"""

# პირობითი ცვლადები
temperature = 32
humidity = 60
wind_speed = 15
cloudy = False
raining = True

# სხვადასხვა ლოგიკური და შედარების ოპერაციების შედეგები
a = temperature > 30 and not cloudy  # True (ტემპერატურა 30-ზე მეტია და ღრუბლიანი არ არის)
b = humidity < 50 or wind_speed > 10  # True (ტენიანობა 50-ზე ნაკლებია ან ქარის სიჩქარე 10-ზე მეტია)
c = not (raining and temperature < 20)  # True (არ არის ის შემთხვევა, როცა წვიმს და ტემპერატურა 20-ზე დაბალია)
d = wind_speed >= 10 and humidity >= 60  # True (ქარის სიჩქარე 10-ზე მეტია და ტენიანობა 60-ზე მეტი ან ტოლია)
e = temperature == 32 or (raining and cloudy)  # True (ტემპერატურა 32-ია ან წვიმს და ღრუბლიანია)