"""დაწერეთ რა არის ფუნქცია, რისთვის ვიყენებთ, რამდენი ტიპის არსებობს, რა არის პარამეტრები, არგუმენტები და დაბრუნება (return)"""

"""ფუნქცია არის კოდის ბლოკი, რომელსაც კონკრეტული ამოცანის შესრულება შეუძლია.
მისი გამოყენებით შეგვიძლია:

კოდი გავამარტივოთ და დავამოკლოთ

ერთი და იგივე მოქმედება მრავალჯერ გამოვიყენოთ

კოდის გადახედვა და შეცვლა გავადვილოთ

"""

"""რისთვის ვიყენებთ ფუნქციებს?
განმეორებადი კოდის თავიდან ასარიდებლად

რთული პროგრამის მცირე ნაწილებად გასაყოფად

კოდის სტრუქტურიზაციისთვის და გააზრების გასაადვილებლად"""


"""ფუნქციების ტიპები (Python-ში):
ჩაშენებული ფუნქციები (built-in)
მაგალითად: print(), len(), input(), type() და სხვ.

მომხმარებლის მიერ შექმნილი ფუნქციები (user-defined)
ფუნქციები, რომლებიც თავად ვქმნით def სიტყვით."""

"""პარამეტრები და არგუმენტები
პარამეტრები — ეს არის ცვლადები, რომლებსაც ფუნქცია იღებს დეფინიციის დროს
მაგ. def greet(name): — აქ name არის პარამეტრი

არგუმენტები — ეს არის რეალური მნიშვნელობები, რომლებიც ფუნქციაში გადაეცემა გამოძახების დროს
მაგ. greet("Ioane") — "Ioane" არის არგუმენტი"""

"""დაბრუნება (return)
return გამოიყენება ფუნქციიდან მნიშვნელობის დასაბრუნებლად.

ფუნქცია return-ით აბრუნებს შედეგს უკან, რაც შეიძლება სხვა ცვლადში შევინახოთ ან გამოვიყენოთ.

"""

#მაგალითი:

# ფუნქციის შექმნა
def add(a, b):        # a და b არის პარამეტრები
    result = a + b
    return result     # ფუნქცია აბრუნებს შედეგს

# ფუნქციის გამოძახება
sum = add(5, 3)        # 5 და 3 არის არგუმენტები
print("ჯამი:", sum)