"""გააკეთეთ პროგრამა რომელშიც გექნებათ ცვლდი სადაც შეინახავთ თქვენს hobby-ის, ასევე შექმენით string ტიპის ცვლადი რომელშიც შეინახვათ თქვენთვის 
სასურველ მესიჯს, შემდეგ ეს ორი ტექსტი დაბეჭდეთ ერთად, ასევე აიღეთ 2 integer ტიპის ცვლადი და დაბეჭდეთ მათი შეკრებაც, თქვენი სიტყვებით ახსენით 
რა განსხვავებაა ამ ორი სხვადასხვა ტიპის ცვლადების დამატების ოპერაციებს შორის, რა ეწოდება თითოეულ მოვლენას"""
hobby = "Judo"
message = "Is My fav sport"
number1 = 8
number2 = 42
print(hobby + " " + message)
print(number1 + number2)
#სტრინგი არის ტექსტური გამოსახულება და ჩვენ არ შეგვიძლია მათემატიკური გამოთვლების შესრულება და ინტეგერით შეგვიძლია ამის გაკეთება
