"""upper(),
5) შემოიტანეთ სიტყვა input-ით და დაბეჭდეთ დიდი ასოებით

6) მოცემული სიაა: ["Georgia", "Armenia", "Greece", "Norway", "Denmark"]. ყველა ქვეყანა გადააკეთეთ დიდი ასოებად და დაბეჭდეთ

7) შემოიტანეთ სიტყვა input-ით და შეამოწმეთ, არის თუ არა ის მთლიანად დიდი ასოებით"""

# 5) შემოიტანეთ სიტყვა და დაბეჭდეთ დიდი ასოებით
word = input("შეიყვანეთ სიტყვა: ")
print("დიდი ასოებით:", word.upper())

# 6) სია გადააქციეთ დიდი ასოებად და დაბეჭდეთ
countries = ["Georgia", "Armenia", "Greece", "Norway", "Denmark"]
print("ქვეყნები დიდი ასოებით:")
for country in countries:
    print(country.upper())

# 7) შემოიტანეთ სიტყვა და შეამოწმეთ არის თუ არა მთლიანად დიდი ასოებით
word_check = input("შეიყვანეთ სიტყვა შემოწმებისთვის: ")
if word_check.isupper():
    print("სიტყვა არის მთლიანად დიდი ასოებით.")
else:
    print("სიტყვა არ არის მთლიანად დიდი ასოებით.")