#შექმენით 5 ცვლადი რომლებშიც შეინახავთ წიგნების თავდაპირველ ფასს, შემდეგ შექმენით ცვლადი რომელშიც შეინახავთ ფასდაკლების ოდენობას, შექმენით ახალი ფასის მქონე წიგნების ცვლადები, რომელთა მნიშვნელობა იქნება ძველ მნიშვნელობას გამოკლებული ახალი, საბოლოოდ კი დაბეჭდეთ ახალი წიგნების ფასები (გამოიყენეთ კარგი მიდგომები: რომ ცვლადის მნიშვნელობის მინიჭებისას შეგიძლიათ სხვა ცვლადის გამოყენება, კოდი ახსენით კომენტარების საშვალებით, ცვლადებს დაარქვით აღმწერი სახელები snake_case-ის სტილში)

#წიგნებს მივეცით ფასები
book1_price=20
book2_price=17
book3_price=25
book4_price=15
book5_price=18

#ავღნიშნეთ ფასდაკლების მნიშვნელობა
sale=5

#შევქმენით წიგნებისთვის ახალი ფასები ფასდაკლების შემდეგ
book1_new_price=(book1_price - sale)
book2_new_price=(book2_price - sale)
book3_new_price=(book3_price - sale)
book4_new_price=(book4_price - sale)
book5_new_price=(book5_price - sale)

#დავბეჭდეთ წიგნების ახალი ფასები
print(book1_new_price)
print(book2_new_price)
print(book3_new_price)
print(book4_new_price)
print(book5_new_price)

